Revit 2027 API
Hub.GetHubConnectorManager Method
 Retrieves the ConnectorManager of the Hub.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ConnectorManager GetHubConnectorManager()
Public Function GetHubConnectorManager As ConnectorManager
public:
ConnectorManager^ GetHubConnectorManager()
member GetHubConnectorManager : unit -> ConnectorManager
Return Value
ConnectorManager
 The ConnectorManager.
Remarks
 The ConnectorManager provides information about elements connected via the Hub.
See Also
Reference
Hub Class
Autodesk.Revit.DB.Structure Namespace